<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"ab819ef81224b3e1dcd091cad7e02838f006fd06ef7087f46357f508dd346f51","plan_job_ref":"Job Plan Airflow DAGs #220 at https://github.com/cal-itp/data-infra/actions/runs/16203159763","plan_out_hash":"1dc514cc06f0effcf425159fce9b456cc4c34e86be4b38610ab23716d3f8d2b8","plan_hash":"77c5f84ba05942150a60a7c56255ef081aa90cb3ab55215b18def93a77450997","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 4 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/transitland_hook.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/hooks/transitland_hook.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/hooks/transitland_hook.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/libs/__init__.py"] will be destroyed
  # (because key ["plugins/libs/__init__.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "AAAAAA==" -> null
-       detect_md5hash      = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751950420136018 -> null
-       id                  = "calitp-staging-composer-plugins/libs/__init__.py" -> null
-       md5hash             = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       md5hexhash          = "d41d8cd98f00b204e9800998ecf8427e" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Flibs%2F__init__.py?generation=1751950420136018&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/libs/__init__.py" -> null
-       output_name         = "plugins/libs/__init__.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Flibs%2F__init__.py" -> null
-       source              = "../../../../airflow/plugins/libs/__init__.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/aggregator_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ig+/LA==" -> (known after apply)
!~      detect_md5hash      = "XJkgbCLPyivP+4iiIstZYw==" -> "different hash"
!~      generation          = 1752098038059693 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/aggregator_to_gcs_operator.py"
!~      md5hash             = "XJkgbCLPyivP+4iiIstZYw==" -> (known after apply)
        name                = "plugins/operators/aggregator_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "T9xLgw==" -> (known after apply)
!~      detect_md5hash      = "RZff0J+b/Jka5frQF+tGBw==" -> "different hash"
!~      generation          = 1752103418450207 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "RZff0J+b/Jka5frQF+tGBw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "2RBKew==" -> (known after apply)
!~      detect_md5hash      = "GBSeTJZJB4kNiTmdZKGGYA==" -> "different hash"
!~      generation          = 1752103419653909 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "GBSeTJZJB4kNiTmdZKGGYA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "KvxdLg==" -> (known after apply)
!~      detect_md5hash      = "kh10Bt2VtvG+0yNnA5q1/Q==" -> "different hash"
!~      generation          = 1752103419390838 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "kh10Bt2VtvG+0yNnA5q1/Q==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #220](https://github.com/cal-itp/data-infra/actions/runs/16203159763)